<a href="https://colab.research.google.com/github/temple17/python-for-data-analysis-2nd-edition/blob/main/Chapter7_(p_209~).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [1]:
import numpy as np
import pandas as pd

## Chapter 7. Data Cleaning and Preparation

In [2]:
# 7.1 Handling Missing Data

In [3]:
string_data = pd.Series(['aardvark', 'artichoke', np.nan, 'avocado'])

In [4]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [5]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [6]:
string_data[0] = None

In [7]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [8]:
from numpy import nan as NA

In [9]:
data = pd.Series([1,NA,3.5,NA,7])

In [10]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [11]:
data[data.notnull()]

0    1.0
2    3.5
4    7.0
dtype: float64

In [12]:
data = pd.DataFrame([[1., 6.5, 3.], [1., NA, NA],
                     [NA, NA, NA], [NA, 6.5, 3.]])

In [13]:
cleaned = data.dropna()

In [14]:
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [15]:
cleaned

     0    1    2
0  1.0  6.5  3.0

In [16]:
data.dropna(how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [17]:
data[4] = NA

In [18]:
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [19]:
data.dropna(axis = 1, how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [20]:
df = pd.DataFrame(np.random.randn(7,3))

In [21]:
df.iloc[:4, 1] = NA

In [22]:
df.iloc[:2, 2] = NA

In [23]:
df

          0         1         2
0 -0.222547       NaN       NaN
1  0.790298       NaN       NaN
2 -0.018265       NaN -1.408619
3  0.388678       NaN  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [24]:
df.dropna(thresh = 2)

          0         1         2
2 -0.018265       NaN -1.408619
3  0.388678       NaN  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [25]:
# Filling in Missing data

df.fillna(0)

          0         1         2
0 -0.222547  0.000000  0.000000
1  0.790298  0.000000  0.000000
2 -0.018265  0.000000 -1.408619
3  0.388678  0.000000  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [26]:
df.fillna({1: 0.5, 2:0})

          0         1         2
0 -0.222547  0.500000  0.000000
1  0.790298  0.500000  0.000000
2 -0.018265  0.500000 -1.408619
3  0.388678  0.500000  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [27]:
_ = df.fillna(0, inplace = True)

In [28]:
df

          0         1         2
0 -0.222547  0.000000  0.000000
1  0.790298  0.000000  0.000000
2 -0.018265  0.000000 -1.408619
3  0.388678  0.000000  0.160973
4 -0.553226 -1.844799 -0.389269
5 -0.544471  0.023996 -1.520885
6 -1.158734 -0.379442 -1.031515

In [29]:
df = pd.DataFrame(np.random.randn(6,3))

In [30]:
df.iloc[2:, 1] = NA

In [31]:
df.iloc[4:, 2] = NA

In [32]:
df

          0         1         2
0 -0.765450  1.302008  0.801479
1  0.049726 -1.229328 -0.295732
2 -0.337462       NaN -1.042034
3  0.109452       NaN  0.986689
4  2.002633       NaN       NaN
5  0.040939       NaN       NaN

In [33]:
df.fillna(method = 'ffill')

          0         1         2
0 -0.765450  1.302008  0.801479
1  0.049726 -1.229328 -0.295732
2 -0.337462 -1.229328 -1.042034
3  0.109452 -1.229328  0.986689
4  2.002633 -1.229328  0.986689
5  0.040939 -1.229328  0.986689

In [34]:
df.fillna(method = 'ffill', limit = 2)

          0         1         2
0 -0.765450  1.302008  0.801479
1  0.049726 -1.229328 -0.295732
2 -0.337462 -1.229328 -1.042034
3  0.109452 -1.229328  0.986689
4  2.002633       NaN  0.986689
5  0.040939       NaN  0.986689

In [35]:
data = pd.Series([1., NA, 3.5, NA, 7])

In [36]:
data.fillna(data.mean())

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

In [37]:
# 7.2 Data Transformation

data = pd.DataFrame({'k1' : ['one','two'] * 3 + ['two'],
                     'k2' : [1, 1, 2, 3, 3, 4, 4]})

In [38]:
data

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4
6  two   4

In [39]:
data.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6     True
dtype: bool

In [40]:
data.drop_duplicates()

    k1  k2
0  one   1
1  two   1
2  one   2
3  two   3
4  one   3
5  two   4

In [41]:
data['v1'] = range(7)

In [42]:
data.drop_duplicates(['k1'])

    k1  k2  v1
0  one   1   0
1  two   1   1

In [43]:
data.drop_duplicates(['k1','k2'], keep = 'last')

    k1  k2  v1
0  one   1   0
1  two   1   1
2  one   2   2
3  two   3   3
4  one   3   4
6  two   4   6

In [45]:
data = pd.DataFrame({'food' : ['bacon', 'pulled pork', 'bacon',
                               'Pastrami', 'corned beef', 'Bacon',
                               'pastrami', 'honey ham', 'nova lox'],
                     'ounces' : [4,3,12,6,7.5,8,3,5,6]})

In [46]:
data

          food  ounces
0        bacon     4.0
1  pulled pork     3.0
2        bacon    12.0
3     Pastrami     6.0
4  corned beef     7.5
5        Bacon     8.0
6     pastrami     3.0
7    honey ham     5.0
8     nova lox     6.0

In [47]:
meat_to_animal = {
    'bacon' : 'pig',
    'pulled pork' : 'pig',
    'pastrami' : 'cow',
    'corned beef' : 'cow',
    'honey ham' : 'pig',
    'nova lox' : 'salmon'
}

In [48]:
lowercased = data['food'].str.lower()

In [49]:
lowercased

0          bacon
1    pulled pork
2          bacon
3       pastrami
4    corned beef
5          bacon
6       pastrami
7      honey ham
8       nova lox
Name: food, dtype: object

In [50]:
data['animal'] = lowercased.map(meat_to_animal)

In [51]:
data

          food  ounces  animal
0        bacon     4.0     pig
1  pulled pork     3.0     pig
2        bacon    12.0     pig
3     Pastrami     6.0     cow
4  corned beef     7.5     cow
5        Bacon     8.0     pig
6     pastrami     3.0     cow
7    honey ham     5.0     pig
8     nova lox     6.0  salmon

In [52]:
data['food'].map(lambda x: meat_to_animal[x.lower()])

0       pig
1       pig
2       pig
3       cow
4       cow
5       pig
6       cow
7       pig
8    salmon
Name: food, dtype: object

In [53]:
data = pd.Series([1., -999., 2., -999., -1000., 3.])

In [54]:
data

0       1.0
1    -999.0
2       2.0
3    -999.0
4   -1000.0
5       3.0
dtype: float64

In [56]:
data.replace(-999, np.nan)

0       1.0
1       NaN
2       2.0
3       NaN
4   -1000.0
5       3.0
dtype: float64

In [57]:
data.replace([-999, -1000], np.nan)

0    1.0
1    NaN
2    2.0
3    NaN
4    NaN
5    3.0
dtype: float64

In [59]:
data.replace([-999,-1000], [np.nan, 0])

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [60]:
data.replace({-999: np.nan, -1000: 0})

0    1.0
1    NaN
2    2.0
3    NaN
4    0.0
5    3.0
dtype: float64

In [61]:
data = pd.DataFrame(np.arange(12).reshape((3,4)),
                    index = ['Ohio', 'Colorado', 'New York'],
                    columns =['one', 'two', 'three', 'four'])

In [62]:
transform = lambda x : x[:4].upper()

In [63]:
data.index.map(transform)

Index(['OHIO', 'COLO', 'NEW '], dtype='object')

In [64]:
data.index = data.index.map(transform)

In [65]:
data

      one  two  three  four
OHIO    0    1      2     3
COLO    4    5      6     7
NEW     8    9     10    11

In [66]:
data.rename(index = str.title, columns = str.upper)

      ONE  TWO  THREE  FOUR
Ohio    0    1      2     3
Colo    4    5      6     7
New     8    9     10    11

In [67]:
data.rename(index = {'OHIO': 'INDIANA'},
            columns = {'three' : 'peekaboo'})

         one  two  peekaboo  four
INDIANA    0    1         2     3
COLO       4    5         6     7
NEW        8    9        10    11

In [68]:
data.rename(index = {'OHIO' : 'INDIANA'}, inplace = True)

In [69]:
data

         one  two  three  four
INDIANA    0    1      2     3
COLO       4    5      6     7
NEW        8    9     10    11

In [70]:
ages = [20, 22, 25, 27, 21, 23, 37, 31, 61, 45, 41, 32]

In [71]:
bins = [18,25,35,60,100]

In [72]:
cats = pd.cut(ages, bins)

In [73]:
cats

[(18, 25], (18, 25], (18, 25], (25, 35], (18, 25], ..., (25, 35], (60, 100], (35, 60], (35, 60], (25, 35]]
Length: 12
Categories (4, interval[int64]): [(18, 25] < (25, 35] < (35, 60] < (60, 100]]

In [75]:
cats.codes

array([0, 0, 0, 1, 0, 0, 2, 1, 3, 2, 2, 1], dtype=int8)

In [76]:
cats.categories

IntervalIndex([(18, 25], (25, 35], (35, 60], (60, 100]],
              closed='right',
              dtype='interval[int64]')

In [78]:
pd.value_counts(cats)

(18, 25]     5
(35, 60]     3
(25, 35]     3
(60, 100]    1
dtype: int64

In [79]:
pd.cut(ages, [18, 26, 36, 61, 100], right = False)

[[18, 26), [18, 26), [18, 26), [26, 36), [18, 26), ..., [26, 36), [61, 100), [36, 61), [36, 61), [26, 36)]
Length: 12
Categories (4, interval[int64]): [[18, 26) < [26, 36) < [36, 61) < [61, 100)]

In [80]:
group_names = ['Youth', 'YoungAdult', 'MiddleAged', 'Senior']

In [81]:
pd.cut(ages, bins, labels = group_names)

['Youth', 'Youth', 'Youth', 'YoungAdult', 'Youth', ..., 'YoungAdult', 'Senior', 'MiddleAged', 'MiddleAged', 'YoungAdult']
Length: 12
Categories (4, object): ['Youth' < 'YoungAdult' < 'MiddleAged' < 'Senior']

In [82]:
data = np.random.rand(20)

In [83]:
pd.cut(data, 4 , precision=2)

[(0.027, 0.27], (0.75, 1.0], (0.27, 0.51], (0.27, 0.51], (0.27, 0.51], ..., (0.27, 0.51], (0.75, 1.0], (0.27, 0.51], (0.027, 0.27], (0.027, 0.27]]
Length: 20
Categories (4, interval[float64]): [(0.027, 0.27] < (0.27, 0.51] < (0.51, 0.75] < (0.75, 1.0]]

In [84]:
data = np.random.randn(1000)

In [85]:
cats = pd.qcut(data, 4)

In [86]:
cats

[(-0.673, 0.00717], (-2.606, -0.673], (-2.606, -0.673], (-0.673, 0.00717], (0.666, 3.323], ..., (-2.606, -0.673], (0.666, 3.323], (-0.673, 0.00717], (0.666, 3.323], (-0.673, 0.00717]]
Length: 1000
Categories (4, interval[float64]): [(-2.606, -0.673] < (-0.673, 0.00717] < (0.00717, 0.666] <
                                    (0.666, 3.323]]

In [87]:
pd.value_counts(cats)

(0.666, 3.323]       250
(0.00717, 0.666]     250
(-0.673, 0.00717]    250
(-2.606, -0.673]     250
dtype: int64

In [88]:
pd.qcut(data, [0, 0.1, 0.5, 0.9, 1.])

[(-1.322, 0.00717], (-1.322, 0.00717], (-1.322, 0.00717], (-1.322, 0.00717], (0.00717, 1.215], ..., (-1.322, 0.00717], (0.00717, 1.215], (-1.322, 0.00717], (0.00717, 1.215], (-1.322, 0.00717]]
Length: 1000
Categories (4, interval[float64]): [(-2.606, -1.322] < (-1.322, 0.00717] < (0.00717, 1.215] <
                                    (1.215, 3.323]]